Repository: StarSkyGeminid/reinmkg
Catalog: lib/core/localization/l10n/app_*.arb
Languages: id

# version
source: Version {version}
id: Versi {version}

# idText
source: Indonesian
id: Indonesia

# enText
source: English
id: Inggris

# languageText
source: Language
id: Bahasa

# languageSelectionText
source: Select Language
id: Pilih Bahasa

# languageFromLocale
source: {locale, select, en{English} id{Indonesia} other{Unknown}}
id: {locale, select, en{English} id{Indonesia} other{Tidak Diketahui}}

# unitText
source: Unit
id: Satuan

# unitSelectionTypeText
source: Select Unit
id: Pilih Satuan

# unitType
source: {unit, select, metric{Metric} imperial{Imperial} other{Unknown}}
id: {unit, select, metric{Metrik} imperial{Imperial} other{Tidak Diketahui}}

# unitMetricExampleText
source: Metric (°C, kmph)
id: Metrik (°C, kmpj)

# unitImperialExampleText
source: Imperial (°F, mph)
id: Imperial (°F, mpj)

# generalSettingsText
source: General Settings
id: Pengaturan

# wtrClearSkies
source: Clear Sky
id: Cerah

# wtrPartlyCloudy
source: Partly Cloudy
id: Sebagian Berawan

# wtrMostlyCloudy
source: Mostly Cloudy
id: Berawan

# wtrOvercast
source: Overcast
id: Mendung

# wtrHaze
source: Haze
id: Kabut

# wtrSmoke
source: Smoke
id: Asap

# wtrFog
source: Fog
id: Kabut

# wtrLightRain
source: Light Rain
id: Hujan Ringan

# wtrRain
source: Rain
id: Hujan

# wtrHeavyRain
source: Heavy Rain
id: Hujan Lebat

# wtrIsolatedShower
source: Isolated Shower
id: Hujan Lokal

# wtrSevereThunderStorm
source: Severe Thunder Storm
id: Badai Guntur yang Parah

# now
source: Today
id: Hari ini

source: Humidity
id: Humiditas

# windSpeed
source: Wind
id: Angin

source: Wind Direction
id: Arah Angin

source: Weather Forecast
id: Prakiraan Cuaca

# glossariumText
source: Glossary
id: Glosarium

# weatherText
source: Weather
id: Cuaca

# sateliteText
source: Satelite
id: Satelit

# earthquakeText
source: Earthquake
id: Gempa Bumi

# weatherGlosariumTitle
source: Weather Glossary
id: Glosari Cuaca

# weatherIconDescriptionTitle
source: Weather Icon Description
id: Keterangan Ikon Cuaca

# weatherClearDescription
source: The sky is not covered by clouds or the part of the sky covered by clouds is only 1 okta¹.
id: Langit tidak tertutup awan atau bagian langit yang tertutup awan hanya 1 oktas¹.

# weatherPartlyCloudyDescription
source: Cloud-covered sky between 2-3 okta¹.
id: Langit yang tertutup awan antara 2-3 oktas¹.

# weatherMostlyCloudyDescription
source: Cloud-covered sky between 4-6 okta¹.
id: Langit yang tertutup awan antara 4-6 oktas¹.

# weatherOvercastDescription
source: Cloud-covered sky between 7-8 okta¹.
id: Langit yang tertutup awan antara 7-8 oktas¹.

# weatherHazeDescription
source: Reduced visibility due to fine particles such as dust or pollution suspended in the air.
id: Reduksi jarak pandang akibat partikel halus seperti debu atau polusi yang menggantung di udara.

# weatherSmokeDescription
source: Dust particles, smoke or harmful gases that create a thick and hazardous layer of air near the ground.
id: Partikel debu, asap, atau gas berbahaya yang menciptakan lapisan udara tebal dan berbahaya di dekat permukaan tanah.

# weatherFogDescription
source: Water vapor near the ground condenses and becomes cloud-like.
id: Uap air yang berada dekat permukaan tanah berkondensasi dan menjadi mirip awan.

# weatherRainDescription
source: Rain with rainfall accumulation between 20-50 mm/day or 5-20 mm/hour.
id: Hujan dengan akumulasi curah hujan antara 5-20 mm/hari atau 0.1-5 mm/jam.

# weatherLightRainDescription
source: Rain with rainfall accumulation between 5-20 mm/day or 0.1-5 mm/hour.
id: Hujan dengan akumulasi curah hujan antara 20-50 mm/hari atau 5-20 mm/jam.

# weatherHeavyRainDescription
source: Rain with rainfall accumulation >50 mm/day or >20 mm/hour.
id: Hujan dengan akumulasi curah hujan >50 mm/hari atau >20 mm/jam.

# weatherIsolatedShowerDescription
source: Light to moderate rain that falls sporadically in certain locations, with a small area coverage and often does not last long.
id: Hujan ringan hingga sedang yang turun secara sporadis di lokasi tertentu, dengan cakupan wilayah kecil dan sering tidak berlangsung lama.

# weatherSevereThunderStormDescription
source: Rain accompanied by lightning/thunder and strong winds.
id: Hujan yang disertai kilat/petir dan angin kencang.

# aboutOctas
source: [1] Okta is a unit of measurement used to describe the amount of clouds covering the sky at a given location.
id: [1] Oktas merupakan satuan dalam pengukuran untuk mendeskripsikan jumlah awan yang menutupi langit pada suatu lokasi.

# windIconDescriptionTitle
source: Wind Direction Icon Description
id: Keterangan Ikon Arah Angin

# windDirectionNorthDescription
source: Wind Direction from the North (N)
id: Arah Angin dari Utara (U)

# windDirectionNorthEastDescription
source: Wind Direction from the Northeast (NE)
id: Arah Angin dari Timur Laut (TL)

# windDirectionEastDescription
source: Wind Direction from the East (E)
id: Arah Angin dari Timur (T)

# windDirectionSouthEastDescription
source: Wind Direction from Southeast (SE)
id: Arah Angin dari Tenggara (TG)

# windDirectionSouthDescription
source: Wind Direction from South (S)
id: Arah Angin dari Selatan (S)

# windDirectionSouthWestDescription
source: Wind Direction from Southwest (SW)
id: Arah Angin dari Barat Daya (BD)

# windDirectionWestDescription
source: Wind Direction from the West (W)
id: Arah Angin dari Barat (B)

# windDirectionNorthWestDescription
source: Wind Direction from Northwest (NW)
id: Arah Angin dari Barat Laut (BL)

# oneWeekForecast
source: Weekly Forecast
id: Cuaca Sepekan Kedepan

# radarTypeName
source: {value, select, cmax{CMAX} nowcast{NOWCAST} qpf{QPF} cmaxssa{CMAX-SSA} cmaxhwind{CMAX-HWIND} cappi05{{metric, select, metric{CAPPI 0.5Km} other{CAPPI 0.31mil}} } cappi1{{metric, select, metric{CAPPI 0.5Km} other{CAPPI 0.32mil}}} sri{SRI} pac1{PAC 1h} pac6{PAC 6h} pac12{PAC 12h} pac24{PAC 24h} other{Unknown}}
id: {value, select, cmax{CMAX} nowcast{NOWCAST} qpf{QPF} cmaxssa{CMAX-SSA} cmaxhwind{CMAX-HWIND} cappi05{{metric, select, metric{CAPPI 0.5Km} other{CAPPI 0.31mil}} } cappi1{{metric, select, metric{CAPPI 0.5Km} other{CAPPI 0.32mil}}} sri{SRI} pac1{PAC 1jam} pac6{PAC 6jam} pac12{PAC 12jam} pac24{PAC 24jam} other{Unknown}}

# sateliteImage
source: Satelite
id: Citra Satelit

source: Maritime
id: Maritim

# windDirectionValue
source: {value, select, north{N} northEast{NE} east{E} southEast{SE} south{S} southWest{SW} west{W} northWest{NW} other{{value}}}
id: {value, select, north{U} northEast{TL} east{T} southEast{TG} south{S} southWest{BD} west{B} northWest{BL} other{{value}}}

# windDirectionDescription
source: Wind direction from the {direction, select, north{North} northEast{North East} east{East} southEast{South East} south{South} southWest{South West} west{West} northWest{North West} other{{direction}}}
id: Arah Angin dari {direction, select, north{Utara} northEast{Timur Laut} east{Timur} southEast{Tenggara} south{Selatan} southWest{Barat Daya} west{Barat} northWest{Barat Laut} other{{direction}}}

# speedWithUnit
source: {metric, select, true{{nan, select, nan{- kmph} other{{value} kmph}}} other{{nan, select, nan{- mph} other{{value} mph}}}}
id: {metric, select, true{{nan, select, nan{- kmpj} other{{value} kmpj}}} other{{nan, select, nan{- mpj} other{{value} mpj}}}}

# distanceWithUnit
source: {metric, select, true{{nan, select, nan{- km} other{{value} km}}} other{{nan, select, nan{- mile} other{{value, plural, =0{0 mile} =1{1 mile} other{{value} miles}}}}}}
id: {metric, select, true{{nan, select, nan{- km} other{{value} km}}} other{{nan, select, nan{- mil} other{{value} mil}}}}

# eqFelt
source: Earthquake Felt
id: Gempa Dirasakan

# eqRealtime
source: Earthquake Realtime
id: Gempa Terkini

# eqMagnitude
source: Magnitude
id: Magnitudo

# eqDepth
source: Depth
id: Kedalaman

# eqFeltArea
source: Felt Area
id: Wilayah Dirasakan

# tsunamiEarlyWarning
source: Early Warning {value}
id: Peringatan Dini {value}

source: Instruction
id: Instruksi

source: Coordinate
id: Koordinat

source: Description
id: Deksripsi

source: Distance
id: Jarak

source: Time
id: Waktu

source: Show ShakeMap
id: Tampilkan ShakeMap

source: Hide ShakeMap
id: Sembunyikan ShakeMap

# eqWarning
source: {type, select, felt{Earthquake Felt} mover5{M>5 Earthquake} pd1{Tsunami EW-1} pd2{Tsunami EW-2} pd3{Tsunami EW-3} pd4{Tsunami EW-4} other{-}}
id: {type, select, felt{Gempa Dirasakan} mover5{Gempa M>5} pd1{Tsunami PD-1} pd2{Tsunami PD-2} pd3{Tsunami PD-3} pd4{Tsunami PD-4} other{-}}

# eqMenuType
source: {type, select, map{Map} felt{Felt} realtime{Newest} overfive{M > 5} tsunami{Tsunami} other{-}}
id: {type, select, map{Peta} felt{Dirasakan} realtime{Terkini} overfive{M > 5} tsunami{Tsunami} other{-}}

# eqDistance
source: {nan, select, nan{-} other{{distance} {metric, select, true{km} other{{nan, select, nan{- mile} other{{distance, plural, =0{mile} =1{mile} other{miles}}}}}} from your location ({location, select, null{-} other{{location}}})}}
id: {nan, select, null{-} other{{distance} {metric, select, true{km} other{mil}} dari lokasi Anda ({location, select, null{-} other{{location}}}}}

source: Legend
id: Legenda

source: Rain Intensity
id: Intensitas Hujan

# rainLight
source: Light
id: Ringan

# rainModerate
source: Moderate
id: Sedang

# rainHeavy
source: Heavy
id: Lebat

# rainVeryHeavy
source: Very Heavy
id: Sangat Lebat

source: Hour
id: Jam

# waveHeightStatus
source: {status, select, calm{Calm} low{Low} medium{Medium} high{High} veryhigh{Very Heigh} extreme{Extreme} veryextreme{Very Extreme} other{Unkown}}
id: {status, select, calm{Tenang} low{Rendah} medium{Sedang} high{Tinggi} veryhigh{Sangat Tinggi} extreme{Ekstrim} veryextreme{Sangat Ekstrim} other{Unkown}}

# illumination
source: {value}% Illuminated
id: Bercahaya {value}%

# riseSetText
source: Rise - Set
id: Terbit - Terbenam

# sunText
source: Sun
id: Matahari

# sunriseText
source: Sunrise
id: Terbit

# sunsetText
source: Sunset
id: Tenggelam

# moonText
source: Moon
id: Bulan

# moonriseText
source: Moonrise
id: Terbit

# moonsetText
source: Moonset
id: Tenggelam

# moonphaseText
source: {status, select, newMoon{New Moon} waxingCrescent{Waxing Crescent} firstQuarter{First Quarter} waxingGibbous{Waxing Gibbous} fullMoon{Full Moon} waningGibbous{Waning Gibbous} lastQuarter{Last Quarter} waningCrescent{Waning Crescent} other{Unkown}}
id: {status, select, newMoon{Bulan Baru} waxingCrescent{Bulan Sabit} firstQuarter{Perbani Awal} waxingGibbous{Cembung} fullMoon{Purnama} waningGibbous{Cembung} lastQuarter{Perbani Akhir} waningCrescent{Bulan Sabit} other{Unkown}}
